-- Заполняем таблицу клиентов
INSERT INTO client(fio, birth_date, home_address, phone_number)
VALUES ('Пугачева Руфина Матвеевна', '1978-01-12'::date, 'г. Романовка, ул. Маршала Кожедуба, дом 188, квартира 985',
        '9077666409'),
       ('Карпова Генриетта Григорьевна', '1991-04-01'::date, 'г. Поддубное, ул. Вагжанова, дом 5, квартира 370',
        '9519303501'),
       ('Бойцова Любомила Игоревна', '2001-10-01'::date,
        'г. Горнозаводск, ул. Новотихвинский 1-й пер, дом 56, квартира 133', '9726418496'),
       ('Сомов Михаил Вячеславович', '1975-09-24'::date, 'г. Инта, ул. Паперника, дом 11, квартира 760', '9089644553'),
       ('Городнов Давид Анатольевич', '1982-05-12'::date, 'г. Луга, ул. Байкальский пер, дом 37, квартира 662',
        '9728184755'),
       ('Симонов Евлампий Геннадиевич', '1980-09-06'::date, 'г. Новогурьевское, ул. 23-я линия, дом 134, квартира 384',
        '9743676585'),
       ('Куколевская Ия Закировна', '1980-10-02'::date, 'г. Электросталь, ул. Галилея, дом 74, квартира 559',
        '9519805524'),
       ('Бабенко Доброслав Михайлович', '1986-11-07'::date, 'г. Луговое, ул. Бойня ст, дом 176, квартира 43',
        '9357298843'),
       ('Руденко Прохор Антонович', '1996-12-01'::date, 'г. Тоцкое, ул. Нансена проезд, дом 170, квартира 385',
        '9947870638'),
       ('Милованова Любава Павловна', '1988-10-24'::date,
        'г. Кантемировка, ул. Боткинский 2-й проезд, дом 26, квартира 848', '9912363477');

-- Заполняем таблицу специальностей врачей
INSERT INTO medic_specialty (name)
VALUES ('Гастроэнтерология'),
       ('Неврология'),
       ('Дерматология'),
       ('Кардиология'),
       ('Офтальмология'),
       ('Рентгенография'),
       ('Терапия'),
       ('Травматология'),
       ('Урология'),
       ('Хирургия');

-- Заполняем таблицу услуг
INSERT INTO service(medic_specialty_id, service_name, fix_price, min_time)
VALUES (1, 'ФГДС', 1400, 5),
       (1, 'УЗИ органов брюшной полости', 700, 10),
       (2, 'Иглорефлексотерапия', 1500, 15),
       (3, 'Удаление пиогенной гранулемы', 2050, 5),
       (3, 'Удаление интрадермального невуса', 2050, 10),
       (4, 'УЗИ сердца', 4500, 25),
       (5, 'Панретинальная лазерная коагуляция', 8950, 30),
       (5, 'Броупексия', 30000, 60),
       (6, 'Рентгенография основания черепа', 900, 45),
       (7, 'Прием врача терапевта первичный', 800, 10),
       (7, 'Прием врача терапевта повторный', 700, 5),
       (8, 'Снятие гипсовой повязки', 1270, 15),
       (9, 'Лечение уретрита', 1170, 35),
       (10, 'Перевязка раны со снятием швов', 900, 25);

-- Заполняем таблицу должностей
INSERT INTO position(name, salary)
VALUES ('Главврач', 100000),
       ('Врач', 50000),
       ('Санитар', 35000),
       ('Администратор', 35000),
       ('Убоорщик', 25000),
       ('Водитель', 30000),
       ('Заместитель главного врача', 85000),
       ('Бухгалтер', 80000),
       ('Начальник отдела кадров', 75000),
       ('Главная медицинская сестра', 45000);

-- Заполняем таблицу сотрудников
INSERT INTO employee(fio, medic_specialty_id, birth_date, experience, position_id)
VALUES ('Байков Афиноген Юрьевич', 7, '1991-02-03'::date, 5, 2),
       ('Суворова Ефросинья Константиновна', 8, '1977-08-03'::date, 15, 2),
       ('Ивлеев Милий Евгеньевич', 10, '02-05-1980'::date, 20, 2),
       ('Добровольский Радован Николаевич', 1, '1986-02-12'::date, 10, 2),
       ('Ерошенко Эрика Игоревна', 2, '1973-04-02'::date, 5, 2),
       ('Архипов Добромысл Аркадьевич', 8, '1999-06-09'::date, 25, 1),
       ('Маркова Зоя Тарасовна', null, '1982-08-24'::date, 5, 8),
       ('Берестов Михаил Евгеньевич', null, '1988-06-04'::date, 10, 9),
       ('Быкова Муза Петровна', null, '1971-09-20'::date, 5, 4),
       ('Королева Аграфена Эдуардовна', null, '1988-04-14'::date, 1, 5);

-- Заполняем таблицу записей на прием
INSERT INTO appointment(client_id, employee_id, service_id, time, office, note)
VALUES (1, 1, 1, now() + interval '1 hour', '102', null),
       (2, 1, 2, now() + interval '2 day' + interval '1 hour', '201', null),
       (2, 2, 3, now() + interval '3 day' + interval '1 hour', '303', 'note1'),
       (3, 2, 10, now() + interval '4 day' + interval '1 hour', '404', 'note2'),
       (3, 3, 10, now() + interval '1 day' + interval '1 hour', '105', 'note3'),
       (3, 3, 5, now() + interval '5 day' + interval '5 hour', '105', null),
       (10, 4, 6, now() + interval '6 day' + interval '2 hour', '106', 'note4'),
       (9, 5, 3, now() + interval '11 day' + interval '3 hour', '305', null),
       (8, 6, 3, now() + interval '1 day' + interval '4 hour', '304', 'note4'),
       (8, 1, 7, now() + interval '1 day' + interval '7 hour', '301', 'note5');

-- Заполняем таблицу мед.карт
INSERT INTO medical_history(client_id, appointment_id, prognosis)
VALUES (1, 1, 'лечить то'),
       (2, 1, 'лечить се'),
       (2, 2, 'лечить1'),
       (3, 10, 'лечить2'),
       (3, 4, 'лечить3'),
       (3, 8, 'лечить4'),
       (10, 5, 'лечить5'),
       (9, 6, 'лечить6'),
       (8, 7, 'лечить7'),
       (8, 7, 'лечить8');